bench_result/value-128_mem-8388608.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=128 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=8388608 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-128_mem-8388608.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000
RawSize:    137.3 MB (estimated)
FileSize:   76.3 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 8.5168 GB
fillrandom   :       1.977 micros/op;   69.5 MB/s 1.98 s

write in SSD size (MB):33.0288
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s