bench_result/value-16384_mem-2097152.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=16384 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=2097152 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-16384_mem-2097152.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     16384 bytes each (8192 bytes after compression)
Entries:    1000000
RawSize:    15640.3 MB (estimated)
FileSize:   7827.8 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 3.09995 GB
fillrandom   :      12.355 micros/op; 1265.9 MB/s 12.36 s

write in SSD size (MB):2725.02
memtable stall time: 1.39219 s
L0 stall time: 0  s
L0 slow stall time: 0  s