bench_result/value-256_mem-67108864.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=256 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=67108864 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-256_mem-67108864.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     256 bytes each (128 bytes after compression)
Entries:    1000000
RawSize:    259.4 MB (estimated)
FileSize:   137.3 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 8.54588 GB
fillrandom   :       2.316 micros/op;  112.0 MB/s 2.32 s

write in SSD size (MB):0
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2      128         0        0       271
  1        1      128         0        0         6

readrandom   :       2.056 micros/op;  126.2 MB/s (1000000 of 1000000 found) 2.06 s

write in SSD size (MB):0
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2      128         0        0       271
  1        1      128         0        0         6

pmem allocs 2
Final Use NVM: 0.250001 GB
Remainder of NVM space : 8.29586 GB